; domain
(define (domain fo-counters-rnd)
    (:requirements :strips :typing :equality :adl :fluents)
    (:types counter)
  (:predicates
    (nop ?x - counter)
  )

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )
)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_3_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 - counter
	)
  (:init
		(= (value c0) 14)
	(= (value c1) 8)
	(= (value c2) 82)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
		)
	)
)

; plan
1. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 1 of 2
2. (increment c1)
   changed: (value c1) from 8 to 9
   goals met: 1 of 2
3. (increment c1)
   changed: (value c1) from 9 to 10
   goals met: 1 of 2
4. (increment c1)
   changed: (value c1) from 10 to 11
   goals met: 1 of 2
5. (increment c1)
   changed: (value c1) from 11 to 12
   goals met: 1 of 2
6. (increment c1)
   changed: (value c1) from 12 to 13
   goals met: 1 of 2
7. (increment c1)
   changed: (value c1) from 13 to 14
   goals met: 1 of 2
8. (increment c1)
   changed: (value c1) from 14 to 15
   goals met: 2 of 2
